Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/edc/PIC32MK0512GPL064.PIC
      <edc:DCRDef edc:_addr="0x1FC63F70" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ABF2SEQ" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0xffffffff" edc:name="ABF2SEQ" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0xffffffff">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="TSEQ" edc:desc="Boot Flash True Sequence Number" edc:mask="0xffff" edc:name="TSEQ" edc:nzwidth="16"/>
            <edc:DCRFieldDef edc:cname="CSEQ" edc:desc="Boot Flash Complement Sequence Number" edc:mask="0xffff" edc:name="CSEQ" edc:nzwidth="16"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:AltConfigFuseSector>
    <edc:AltConfigFuseSector edc:beginaddr="0x1fc63fb0" edc:endaddr="0x1fc64000" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:regionid="boot2config" edc:regionidref="lowerbootaliasconfig" edc:registerprefix="BF2">
      <edc:AdjustPoint edc:_addr="0x1FC63FB0" edc:offset="0xC"/>
      <edc:DCRDef edc:_addr="0x1FC63FBC" edc:access="nnnnnnnn------------------------" edc:cname="BF2DEVCFG4" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0xff000000" edc:name="BF2DEVCFG4" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0xffffffff">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="24"/>
            <edc:DCRFieldDef edc:cname="A1DIFFPR" edc:desc="Opamp 1 Differential Pair Selection" edc:mask="0x3" edc:name="A1DIFFPR" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="USE_PMOS_NMOS" edc:desc="Uses Both PMOS and NMOS Differential Pair" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="USE_NMOS" edc:desc="Uses NMOS Differential Pair" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="USE_PMOS" edc:desc="Use PMOS Differential Pair" edc:when="(field &amp; 0x3) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="A2DIFFPR" edc:desc="Opamp 2 Differential Pair Selection" edc:mask="0x3" edc:name="A2DIFFPR" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="USE_PMOS_NMOS" edc:desc="Uses Both PMOS and NMOS Differential Pair" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="USE_NMOS" edc:desc="Uses NMOS Differential Pair" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="USE_PMOS" edc:desc="Use PMOS Differential Pair" edc:when="(field &amp; 0x3) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="A3DIFFPR" edc:desc="Opamp 3 Differential Pair Selection" edc:mask="0x3" edc:name="A3DIFFPR" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="USE_PMOS_NMOS" edc:desc="Uses Both PMOS and NMOS Differential Pair" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="USE_NMOS" edc:desc="Uses NMOS Differential Pair" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="USE_PMOS" edc:desc="Use PMOS Differential Pair" edc:when="(field &amp; 0x3) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="A5DIFFPR" edc:desc="Opamp 5 Differential Pair Selection" edc:mask="0x3" edc:name="A5DIFFPR" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="USE_PMOS_NMOS" edc:desc="Uses Both PMOS and NMOS Differential Pair" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="USE_NMOS" edc:desc="Uses NMOS Differential Pair" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="USE_PMOS" edc:desc="Use PMOS Differential Pair" edc:when="(field &amp; 0x3) == 0x1"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x1FC63FC0" edc:access="nnnnn---nn-n----nnnnnnnnnnnnnnnn" edc:cname="BF2DEVCFG3" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0xf8d0ffff" edc:name="BF2DEVCFG3" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0xffff0000">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="USERID" edc:desc="" edc:mask="0xffff" edc:name="USERID" edc:nzwidth="16"/>
            <edc:AdjustPoint edc:offset="6"/>
            <edc:DCRFieldDef edc:cname="FUSBIDIO2" edc:desc="USB2 USBID Selection" edc:mask="0x1" edc:name="FUSBIDIO2" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="USBID pin is controlled by the USB2 module" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="USBID pin is controlled by the port function" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="FVBUSIO2" edc:desc="USB2 VBUSON Selection bit" edc:mask="0x1" edc:name="FVBUSIO2" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="VBUSON pin is controlled by the USB2 module" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="VBUSON pin is controlled by the port function" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:DCRFieldDef edc:cname="PGL1WAY" edc:desc="Permission Group Lock One Way Configuration bit" edc:mask="0x1" edc:name="PGL1WAY" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Allow only one reconfiguration" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Allow multiple reconfigurations" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="PMDL1WAY" edc:desc="Peripheral Module Disable Configuration" edc:mask="0x1" edc:name="PMDL1WAY" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Allow only one reconfiguration" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Allow multiple reconfigurations" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="IOL1WAY" edc:desc="Peripheral Pin Select Configuration" edc:mask="0x1" edc:name="IOL1WAY" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Allow only one reconfiguration" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Allow multiple reconfigurations" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="FUSBIDIO1" edc:desc="USB1 USBID Selection" edc:mask="0x1" edc:name="FUSBIDIO1" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="USBID pin is controlled by the USB1 module" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="USBID pin is controlled by the port function" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="FVBUSIO1" edc:desc="USB2 VBUSON Selection bit" edc:mask="0x1" edc:name="FVBUSIO1" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="VBUSON pin is controlled by the USB1 module" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="VBUSON pin is controlled by the port function" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
