Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/edc/PIC32MK0512GPL064.PIC
      <edc:SFRDef edc:_addr="0x1F8604B0" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="5" edc:access="----------------nnnn------------" edc:cname="CNFE" edc:desc="" edc:impl="0xf000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000------------" edc:name="CNFE" edc:nzwidth="32" edc:por="----------------0000------------" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTE">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNFE12" edc:mask="0x1" edc:name="CNFE12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFE13" edc:mask="0x1" edc:name="CNFE13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFE14" edc:mask="0x1" edc:name="CNFE14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFE15" edc:mask="0x1" edc:name="CNFE15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8604C0" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="5" edc:access="----------------nnnn------------" edc:cname="SRCON0E" edc:desc="" edc:impl="0xf000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000------------" edc:name="SRCON0E" edc:nzwidth="32" edc:por="----------------0000------------" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTE">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SR0E12" edc:mask="0x1" edc:name="SR0E12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0E13" edc:mask="0x1" edc:name="SR0E13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0E14" edc:mask="0x1" edc:name="SR0E14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0E15" edc:mask="0x1" edc:name="SR0E15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8604D0" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="5" edc:access="----------------nnnn------------" edc:cname="SRCON1E" edc:desc="" edc:impl="0xf000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000------------" edc:name="SRCON1E" edc:nzwidth="32" edc:por="----------------0000------------" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTE">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SR1E12" edc:mask="0x1" edc:name="SR1E12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1E13" edc:mask="0x1" edc:name="SR1E13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1E14" edc:mask="0x1" edc:name="SR1E14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1E15" edc:mask="0x1" edc:name="SR1E15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8604E0" edc:offset="0x20"/>
      <edc:AdjustPoint edc:_addr="0x1F860500" edc:offset="16"/>
      <edc:SFRDef edc:_addr="0x1F860510" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="6" edc:access="------------------------------nn" edc:cname="TRISF" edc:desc="" edc:grp="PORTF" edc:impl="0xffff0003" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------------11" edc:name="TRISF" edc:nzwidth="0x20" edc:por="------------------------------11" edc:portals="CLR SET INV">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TRISF0" edc:desc="" edc:mask="0x1" edc:name="TRISF0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISF1" edc:desc="" edc:mask="0x1" edc:name="TRISF1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
